// const DiagramData = [
//     {
//         title: 'ראש הרשות',
//         content: (
//             <>
//                 טקסט חסר, יש להשלים מקור.
//             </>
//         )
//     },
//     {
//         title: ' מנכ"ל / רמ"ט',
//         content: (
//             <>
//                 טקסט חסר, יש להשלים מקור.
//             </>
//         )
//     },
//     {
//         title: 'אגף חירום וביטחון',
//         content: (
//             <>
//                 <b>תפקיד המכלול: ניהול עבודת המטה של הרשות המקומית בחירום</b>
//                 <ul>
//                     <li>הפעלה של מרכז ההפעלה ומערכי השליטה, הדיווח והבקרה;
//                     </li>
//                     <li>ריכוז התמ"ץ הרשותי מכלל המכלולים לכדי תמונת מצב אחידה;
//                     </li>
//                     <li>ביצוע בקרה ומעקב אחר הנחיות ראש הרשות ומנהל הלחימה במרכז ההפעלה;
//                     </li>
//                     <li>הפעלת הכוחות המבצעיים ברשות בהתאם לצורך;</li>
//                     <li>וידוא פעילות הרשות בהתאם לשעון הפעילות הרשותי בחירום;
//                     </li>
//                     <li>הפעלת חפ"ק רשותי במקרה הצורך, או השתלבות בחפ"ק אחוד של מנהל האירוע בשטח;
//                     </li>
//                     <li>הפעלת מערכי החירום לפי תפיסת ההפעלה ובכפוף להחלטת ראש הרשות;
//                     </li>
//                     <li>תיאום אופרטיבי של הרשות מול גורמי החירום והביטחון ומתן מענה בחירום;
//                     </li>
//                 </ul>
//                 <br />
//                 <b>תאים במסגרת המכלול:
//                 </b>
//                 <br />
//                 - תא חירום וביטחון
//                 <br />
//                 - תא מבצעים (שליטה ודיווח)
//                 <br />
//                 - תא ניהול שולחן מרכזי
//             </>
//         )
//     },
//     {
//         title: 'יק"לר',
//         content: (
//             <>
//                 טקסט חסר, יש להשלים מקור.
//             </>
//         )
//     },
//     {
//         title: 'כוחות ביטחון',
//         content: (
//             <>
//                 טקסט חסר, יש להשלים מקור.
//             </>
//         )
//     },
//     {
//         title: 'מכלול אוכלוסייה',
//         content: (
//             <>
//                 <b>תפקיד המכלול: מתן מענה לתושבי הרשות ע"פ יעדי השירות בתחומים: רווחה, בריאות, פס"ח ודת
//                 </b>
//                 <ul>
//                     <li>גיבוש תמונת מצב והערכת מצב האוכלוסייה ברשות, חיזוי התנהגותה וצרכיה וגיבוש תוכניות פעולה בהתאם;
//                     </li>
//                     <li>
//                         העברת נתונים על האוכלוסייה באזור האירוע ומסירתם לגוף החירום המנהל את האירוע (צה"ל-פיקוד העורף או משטרת ישראל)
//                     </li>
//                     <li>
//                         איתור ואבחון קבוצות אוכלוסייה הנזקקות לסיוע לאור המצב ומתן המענה הנדרש בתיאום עם מטה החירום הרשותי;
//                     </li>
//                     <li>
//                         תיאום עם הגורמים המקצועיים החיצוניים לרשות בכל הקשור למתן שירותים לאוכלוסייה, כגון קופות החולים, משרד הבריאות הנפתית/מחוזית, משרד הרווחה, משרד עלייה וקליטה, מועצות דתיות, חברות קבורה, המוסד לביטוח לאומי, משרד הבריאות, קצין ההתנהגות ביקל"ר;
//                     </li>
//                     <li>זימון וריכוז פעילות הוועדה לפס"ח;
//                     </li>
//                     <li>זימון וריכוז פעילות הוועדה להתנדבות;
//                     </li>
//                     <li>ניהול מתקני הקליטה של מפונים חסרי קורת גג - בהתייעצות עם ועדת פס"ח;
//                     </li>
//                     <li>פתיחת תחנת ריכוז חללים מקומית/מרחבית לפי הנחיית רשות פס"ח;
//                     </li>
//                     <li>מתן מענה לצורכי התושבים באמצעות מערך המתנדבים ומערכים קהילתיים
//                     </li>
//                 </ul>
//                 <br />
//                 <b>תאים במסגרת המכלול:
//                 </b>    <br />
//                 - תא רווחה
//                 <br />
//                 - תא בריאות
//                 <br />
//                 - תא פס"ח (קליטה וחללים)
//                 <br />
//                 - תא דת
//                 <br />
//                 - תא קליטת עליה
//                 <br />
//                 - תא מתנדבים (משאבי קהילה)
//                 <br />
//                 - צוותי התערבות
//             </>
//         )
//     },
//     {
//         title: ,
//         content: (               
//         )
//     },
//     {
//         title: ,
//         content: (               
//         )
//     },
//     {
//         title: ,
//         content: (               
//         )
//     },
//     {
//         title: ,
//         content: (               
//         )
//     },
//     {
//         title: ,
//         content: (               
//         )
//     },
//     {
//         title: ,
//         content: (               
//         )
//     },
// ];


// export default DiagramData;