const GalleryData = [
    {
      photo: '/assets/images/logos-assessment/assesment1.png',
      title: 'ראש רשות/ רמ"ט',
      headline: '1. ראש רשות/ רמ"ט',
      text: (
        <>
          <b>תפקיד ראש הרשות/ רמ"ט בהערכת מצב:</b>
          <br /> <br />
          מטרה ומיקוד הנושאים המרכזיים בהערכת מצב
        </>
      ),
      video: '/assets/videos/ass1.mp4'
    },
    {
      photo: '/assets/images/logos-assessment/assesment2.png',
      title: 'מרכז שליטה ודיווח (מבצעים)',
      headline: '2. מרכז שליטה ודיווח (מבצעים)',
      text: (
        <><b>תפקיד המכלול בהערכת מצב:</b>
          <br /> <br />
          <b>אירועים מרכזיים</b> ברשות וסטאטוס הטיפול בהם.
          <br />
          <b>תמ"צ כוחות וצוותים</b> בשטח.
          <br />
          <b>סטאטוס מימוש החלטות</b> ראש הרשות/הרמ"ט.
        </>
      ),
      video: '/assets/videos/ass2.mp4'
    },
    {
      photo: '/assets/images/logos-assessment/assesment3.png',
      title: 'יקל"ר',
      headline: '3. יקל"ר',
      text: (
        <><b>תפקיד היקל"ר בהערכת מצב:</b>
          <br /> <br />
          <b>תמ"צ צבאית -</b> הערכת האיום, מצב משפטית, תמ"צ כוחות ומאמצים עיקריים בפקע"ר.
          <br />
          <b> מדיניות התגוננות –</b> מדיניות נוכחית ותמונת מצב
          מימוש המדיניות ופערים (פיקוח ואכיפה, פגיעה
          בשירותים חיוניים) + ריכוז החרגות הרשות.
          <br />
          <b>תמ"צ אוכלוסייה -</b> מגמות אוכלוסייה, צרכים
          והנחיות פיקוד העורף.
          <br />
          <b>סטאטוס בקשות הסיוע</b> של הרשות מפקע"ר
          ודרישות סיוע של פקע"ר מהרשות.
        </>
      )
      ,
      video: '/assets/videos/ass3.mp4'
    },
    {
      photo: '/assets/images/logos-assessment/assesment4.png',
      title: 'מכלול אוכלוסייה',
      headline: '4. מכלול אוכלוסייה',
      text: (<><b>תפקיד המכלול בהערכת מצב:</b>
        <br /> <br />
        <b>כשירות המכלול לביצוע משימותיו.</b>
        <br />
        <b>מגמות התנהגות אוכלוסייה במרחב הרשות וצרכי האוכלוסייה.</b>
        <br />
        <b>תמ"צ משאבי קהילה והתנדבות -</b> משימות למול משאבים ופערים.
        <br />
        <b>תמ"צ רווחה –</b> סטטוס שירותי רווחה ומסגרות למול מדיניות התגוננות.
        <br />
        <b>תמ"צ מתקני קליטה</b> (במידה והופעל) – אוכ' ללא קורת גג, סטטוס נקלטים,
        סטטוס מתקנים ופערים.
        <br />
        <b>תמ"צ בריאות –</b> – סטטוס מתן שירותי רפואה למול מדיניות התגוננות.
        <br />
        <b> תמ"צ דת –</b> סטטוס שירותי דת למול מדיניות התגוננות והיערכות ללוויות.
        <br />
        <b>תמ"צ עלייה וקליטה</b>(במידה וקיים) – עולים במרכזי הקליטה ובקהילה: סטאטוס
        שירותים, צרכים ופערים. <b>פערים והמלצות</b> לטיפול, סיוע ותמיכה בתושבי הרשות.
      </>),
      video: '/assets/videos/ass4.mp4'
    },
    {
      photo: '/assets/images/logos-assessment/assesment5.png',
      title: 'מכלול חינוך',
      headline: '5. מכלול חינוך',
      text: (<><b>תפקיד המכלול בהערכת מצב:</b>
        <br /> <br />
        <b>כשירות המכלול לביצוע משימותיו.</b>
        <br />
        <b>תמ"צ לימודים פדגוגי –</b> – אופן ביצוע לימודים למול
        מדיניות התגוננות, מוכנות מוסדות החינוך ופערים.
        <br />
        <b>תמ"צ חינוך מיוחד –</b> משמעויות ממדיניות ההתגוננות
        ואופן התמיכה בילדים.
        <br />
        <b>תמ"צ חינוך בלתי פורמלי –</b> – סטטוס פעילויות חינוכיות
        למול מדיניות התגוננות.
        <br />
        <b>תמ"צ מסגרות לילדי עובדים –</b>סטטוס הפעלה ופערים.
        <br />
        <b>פערים והמלצות</b> לפעילויות הפגה ופעילויות להספקת
        שירותי חינוך ותמיכה בילדים.
      </>),
      video: '/assets/videos/ass5.mp4'
    },
    {
      photo: '/assets/images/logos-assessment/assesment6.png',
      title: 'מכלול מידע לציבור',
      headline: '6. מכלול מידע לציבור',
      text: (<><b>תפקיד המכלול בהערכת מצב:</b>
        <br /> <br />
        <b>כשירות המכלול לביצוע משימותיו.</b>
        <br />
      
        <b>תמונת מצב צרכי התושבים –</b> מפלטפורמות (המוקד הטלפוני הרשותי, אתר האינטרנט הרשותי, דף פייסבוק ויתר רשתות חברתיות)
        הרשות: פילוח פניות ע"פ נושאים
        וקהלי יעד.
        <br />
        <b>תמונת מצב מימוש תוכנית ההסברה</b> היומית שסוכמה.
        <br />
        <b>המסרים העיקריים לתוכנית הסברה</b> ליממה הקרובה.
        <br />
        <b>מדד תודעת שירות לתושב –</b> סטטוס המענה לפניות התושבים.
        <br />
        <b>פערים והמלצות</b> לפעילות הסברה ולפעולות מענה לצרכי התושבים.
      </>),
      video: '/assets/videos/ass6.mp4'
    },
  
    {
      photo: '/assets/images/logos-assessment/assesment7.png',
      title: 'מכלול הנדסה ותשתיות',
      headline: '7. מכלול הנדסה ותשתיות',
      text: (<><b>תפקיד המכלול בהערכת מצב:</b>
        <br /> <br />
        <b>כשירות המכלול לביצוע משימותיו -</b> כ"א, קבלנים,
        חומרים, ציוד הנדסי.
        <br />
        <b>תמ"צ תשתיות ומבנים –</b> רמת הפגיעה במבנים ורמת
        הנזק בתשתיות.
        <br />
        <b>פעילות לצמצום הסכנות מחומ"ס</b> ומפגעי סביבה.
        <br />
        <b>פערים והמלצות לתעדוף</b> לטיפול במבנים ובתשתיות.
      </>),
      video: '/assets/videos/ass7.mp4'
    },
  
    {
      photo: '/assets/images/logos-assessment/assesment8.png',
      title: 'מכלול לוגיסטיקה ותפעול',
      headline: '8. מכלול לוגיסטיקה ותפעול',
      text: (<><b>תפקיד המכלול בהערכת מצב:</b>
        <br /> <br />
        <b>כשירות המכלול לביצוע משימותיו.</b>
        <br />
        <b>תמ"צ שירותים חיוניים</b> למול מדיניות התגוננות.
        <br />
        <b>תמ"צ היסעים, תחבורה וצמ"ה.</b>
        <br />
        <b>כשירות מחסני החירום</b> למתן מענה רשותי ולהקמת מתקנים.
        <br />
        <b>סיוע הניתן למפעלים חיוניים</b> בגזרת הרשות, לפיקוד העורף ולארגוני החירום.
        <br />
        <b>פערים והמלצות</b> לרכש, הפעלת חוזים נצורים, ויסות רשותי וסיוע חיצוני.
      </>),
      video: '/assets/videos/ass8.mp4'
    },
  
    {
      photo: '/assets/images/logos-assessment/assesment9.png',
      title: 'מכלול משאבי אנוש ומנהל כללי',
      headline: '9. מכלול משאבי אנוש ומנהל כללי',
      text: (<><b>תפקיד המכלול בהערכת מצב:</b>
        <br /> <br />
        <b>תמ"צ כוח אדם</b> למול צרכי הרשות והמלצות לצמצום הפערים.
        <br />
        <b>הנחיות לעובדי הרשות</b> למול מדיניות התגוננות.
        <br />
        <b>תמ"צ תיירים וזרים</b> (ברשות שזה רלוונטי).
        <br />
        <b>כשירות ואבטחת מערכות התקשוב והמידע.</b>
        <br />
        <b>פערים והמלצות</b> לפעולות תמיכה בעובדי הרשות.
      </>),
      video: '/assets/videos/ass9.mp4'
    },
    {
      photo: '/assets/images/logos-assessment/assesment10.png',
      title: 'ארגוני חירום וגופי סיוע',
      headline: '10. ארגוני חירום וגופי סיוע',
      text: (<><b>תפקיד המכלול בהערכת מצב:</b>
        <br /> <br />
        <b>תמ"צ טיפול באירועים.</b>
        <br />
        <b>תמ"צ כוחות בשטח.</b>
      </>),
      video: '/assets/videos/ass10.mp4'
    },
    {
      photo: '/assets/images/logos-assessment/assesment11.png',
      title: 'מרכז שליטה ודיווח (מבצעים)',
      headline: '11. מרכז שליטה ודיווח (מבצעים)',
      text: (<><b>תפקיד המכלול בהערכת מצב:</b>
        <br /> <br />
        <b>כשירות המכלול לביצוע תפקידיו.</b>
        <br />
        <b>תמ"צ מקלטים</b> (ציבוריים ומשותפים) וכשירות צופרים.
        <br />
        <b>מדיניות ההתגוננות –</b> משימות מרכזיות למימוש והמלצות.
        <br />
        <b>דרישות הרשות לסיוע חיצוני</b> ודרישות גופי החירום מהרשות.
      </>),
      video: '/assets/videos/ass2.mp4'
    },
    {
      photo: '/assets/images/logos-assessment/assesment12.png',
      title: 'ראש הרשות',
      headline: '12. ראש הרשות',
      text: (<>
        ראש הרשות יגדיר את סדר העדיפות, יתן הנחיות לביצוע ומשימות לתכנון.
      </>),
      video: '/assets/videos/ass1.mp4'
    },
  
  ];

  export default GalleryData;